students.xlsx 파일을 불러와서

평균 90점 이상 수학80점 이상을 출력하시오

In [2]:
import pandas as pd
df = pd.read_csv('students.csv',index_col='no')
# df.info()

In [5]:
filt = (df['avg']>= 80) & (df['kor'] >= 90)
df[filt]

           name  kor  eng  math  total        avg  rank       sdate
no
38    Anneliese   90   99    55    244  81.333333    64  2024-02-14
57        Luise   96   83    80    259  86.333333     6  2024-09-10
147     Riordan   95   98    80    273  91.000000    80  2024-11-05
154         Ody   90   79    80    249  83.000000    53  2024-03-02
261  Vilhelmina   95   70    75    240  80.000000    48  2024-04-14
348       Alfie   97   80    91    268  89.333333    99  2024-02-16
426       Elmer   90   70    94    254  84.666667    29  2024-10-12
529      Carine   93   73    78    244  81.333333    38  2024-08-01
536       Efren   96   93    61    250  83.333333    63  2024-07-06
563     Lillian   96   68    81    245  81.666667    57  2024-10-26
644      Perkin   90   71    83    244  81.333333    78  2024-03-16
961      Giffer   93  100    67    260  86.666667    85  2024-05-10

In [11]:
# 평균이 60점 이상 또는 국어 70점 이상
filt = ( df['avg'] >= 60 ) | ( df['kor'] >= 70 )
df[filt]

name     412
kor      412
eng      412
math     412
total    412
avg      412
rank     412
sdate    412
dtype: int64

In [18]:
# ## 이름에 t가 들어가면서 평균 점수가 80점 이상
filt = (df['name'].str.contains('t')) & (df['avg'] >= 80)
df[filt]['kor'].count()
# df['name']

np.int64(4)